Revit 2027 API
RebarBendData.HookAngle0 Property
 The angle (in degrees) of the hook at the start. Must be at least 0 and no more than 180. If the value is 0 it means that there is no hook. The default value is 0. When setting from 0 to another value, all crank lengths for start will be set to 0. When setting this value to 0 HookLength0 will be set to 0.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int HookAngle0 { get; set; }
Public Property HookAngle0 As Integer
	Get
	Set
public:
property int HookAngle0 {
	int get ();
	void set (int value);
}
member HookAngle0 : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: hookAngle0 must be at least 0 and no more than 180.
See Also
Reference
RebarBendData Class
Autodesk.Revit.DB.Structure Namespace